[
    "A mossy stone altar can be seen ahead. ",
    "A deserted ritual space can be seen ahead. ",
    "Rusty metal scraps are strewn about on the path ahead. ",
    "You hear a rumor of a treasure outside the town. ",
    "You hear a strange noise, unlike any animal you've heard before. ",
    "A bridge crosses over a deep gorge. ",
    "There is rumor of an adventurer's demise over the next hill. ",
    "You spy an ancient-looking chest resting against a tree. ",
    "The path starts to thin and the trees feel like they are starting to reach towards you. ",
    "The birds and animals around you suddenly have gone silent. ",
    "There is telling of a dangerous cave nearby, holding immense riches. ",
    "An overgrown grove lies ahead. ",
    "The birds and animals around you suddenly have gone silent and you feel as though you are being watched...",
    "This town's inn looks very inviting. ",
    "Thin tendrils of fog are starting to creep across the path. ",
    "A thin, rickety wooden bridge stretches across a canyon. ",
    "There is a rumor of riches stored in a nearby cave. ",
    "There is a rumor that a rich dragon lives nearby. ",
    "There is a rumor that a rivch dragon lives nearby. ",
    "The path widens and there is a small field. ",
    "You found a clearing with sunshine streaming in from above. ",
    "A trail winds up the side of a mountain. ",
    "You found a small clearing. ",
    "A massive, short block of intricately-carved stone can be seen on the side of the path. ",
    "A small path can be seen heading into some brush. ",
    "You stumble across the very fresh remains of another unfortunate adventurer. ",
    "The path opens up into a clearing, and fresh bones can be seen in the grass. ",
    "The remains of some sort of ritual can be found ahead. ",
    "A small trail winds deeper into the forest. ",
    "The path ahead winds down into a valley below. ",
    "There is a rumor of an ancient treasure nearby. ",
    "Your world seems to melt around you, and then reform again with something you cant quite make out infront of you. ",
    "You stumble upon a small grotto. ",
    "You find a cave entrance covered in moss. ",
    "There is telling of a dangerous cave nearby, holding immense riches. You've sure heard this one before ",
    "Glowing stones surrounding what looks to be a deep put lie just up ahead. ",
    "A small glittering object can be seen ahead on the side of the path. ",
    "The birds suddenly stop singing and the silence in the forest is deafening. An open clearing lies ahead. "
]